answer-ls/Lummiss_Plant_Robot/src/demo/sdkconfig.defaults
# ESP32-P4 和开发板存储配置
CONFIG_IDF_TARGET="esp32p4"
# 当前 JC1060P470C 开发板实测芯片为 ESP32-P4 v1.3。
# P4 v1.x 与 v3.x 的程序不兼容，必须选择低于 v3.0 的硬件分支。
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_BOOTLOADER_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y

# 开发板带 32 MB PSRAM，摄像头帧缓冲使用外部内存。
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=150000
# USB-DWC 内部 DMA 可访问 PSRAM：让 UVC 收流的 URB 数据缓冲改落 PSRAM，避开
# 稀缺的内部 DMA 池（视频编码器内部缓冲会占用较多可 DMA 内存）。
CONFIG_USB_HOST_DWC_DMA_CAP_MEMORY_IN_PSRAM=y

# 为测试任务和 USB Host 保留足够栈空间及控制传输缓冲区。
CONFIG_ESP_MAIN_TASK_STACK_SIZE=10240
CONFIG_FREERTOS_HZ=1000
CONFIG_USB_HOST_CONTROL_TRANSFER_MAX_SIZE=4096
CONFIG_USB_HOST_HW_BUFFER_BIAS_IN=y
# 完整 USB/UVC 描述符有数百行，只在定位枚举兼容问题时临时打开。
CONFIG_PRINTF_UVC_CONFIGURATION_DESCRIPTOR=n

# LVGL 8 使用 RGB565；SPI 屏按高字节在前接收，因此在刷新前交换颜色字节。
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_COLOR_16_SWAP=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_48=y
CONFIG_LV_FONT_SIMSUN_16_CJK=y
CONFIG_LWIP_SNTP_MAX_SERVERS=2
CONFIG_LV_BUILD_EXAMPLES=n

# SD 卡 GIF 运行时解码：lv_gif/gifdec 解 320x180 需要约 230KB 画布，
# 超过 LVGL 内置堆的 128KB 上限，必须改走 malloc()（大块会落 PSRAM）。
CONFIG_LV_MEM_CUSTOM=y
CONFIG_LV_USE_GIF=y
# lv_gif 通过 LVGL 文件系统读卡：用 POSIX 驱动（底层 fopen），
# 盘符 'S'，路径直接写 VFS 挂载点 /sdcard。
CONFIG_LV_USE_FS_POSIX=y
CONFIG_LV_FS_POSIX_LETTER=83
CONFIG_LV_FS_POSIX_PATH=""

# 卡上的素材目录是 expressions/，11 个字符超过 8.3；文件名 exp_01.gif 才是 8.3。
# 默认只认短名，按 "expressions" 打不开（FATFS 看到的是 EXPRESS~1）。
CONFIG_FATFS_LONG_FILENAMES=y
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255

# 板载 ESP32-C6 网络协处理器：ESP-Hosted 通过 SDIO Slot 1 通信。
# 引脚和时钟来自同型号 JC1060P470C 厂商的小智示例。
CONFIG_ESP_HOSTED_ENABLED=y
CONFIG_ESP_HOSTED_P4_DEV_BOARD_NONE=y
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y
CONFIG_ESP_HOSTED_IDF_SLAVE_TARGET="esp32c6"
CONFIG_ESP_HOSTED_SDIO_RESET_ACTIVE_HIGH=y
CONFIG_ESP_HOSTED_SDIO_OPTIMIZATION_RX_STREAMING_MODE=y
CONFIG_ESP_HOSTED_SDIO_SLOT_1=y
CONFIG_ESP_HOSTED_SDIO_4_BIT_BUS=y
CONFIG_ESP_HOSTED_SDIO_CLOCK_FREQ_KHZ=40000
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_CMD_SLOT_1=19
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_CLK_SLOT_1=18
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D0_SLOT_1=14
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D1_4BIT_BUS_SLOT_1=15
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D2_4BIT_BUS_SLOT_1=16
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D3_4BIT_BUS_SLOT_1=17
CONFIG_ESP_HOSTED_SDIO_GPIO_RESET_SLAVE=54
CONFIG_ESP_HOSTED_SLAVE_RESET_ON_EVERY_HOST_BOOTUP=y
CONFIG_ESP_HOSTED_GPIO_SLAVE_RESET_SLAVE=54
CONFIG_ESP_HOSTED_USE_MEMPOOL=y

# ESP32-P4 使用远端 WiFi API，具体无线协议栈运行在 ESP32-C6 上。
CONFIG_ESP_WIFI_REMOTE_ENABLED=y
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y
CONFIG_ESP_WIFI_REMOTE_LIBRARY_HOSTED=y
